# -*- coding = utf-8 -*-

#粥5xN-18
Porridge = ['老火白粥',"热牛乳",'咸骨粥',"玉米鸡丝粥","青菜粥",
            "大麦粥","籼子粥","小米粥","黑米粥","绿豆粥","鲜虾粥",
            "红枣荷叶粥","青稞粥","甜豆浆","大米粥","南瓜粥",
            "八宝粥","鱼片粥","皮蛋瘦肉粥"]
PorNum = len(Porridge)
GPorridge = ['大米粥',"青菜粥","大麦粥","籼子粥","小米粥","黑米粥",
             "绿豆粥","青稞粥","豆浆","八宝粥","南瓜粥"]
#早主食4-19
MoStable = ["土豆丝饼","玫瑰馒头","棋子烧饼","胡麻饼","灌汤包",
             "西葫芦蛋饼","甜/酱花卷","窝窝头","千层油糕","素菜包",
             "千层饼","鲜肉包","白菜肉包","银丝卷","豆沙包",
             "加蟹小笼包","奶黄包","蛋烧卖","翡翠烧卖","油条油饼"]
MStNum = len(MoStable)
#咸菜5-15
Pickles = ["萝卜干毛豆","蟹糊","黄泥螺","咸菜肉丝","玫瑰腐乳",
           "油炒大头菜","榨菜","黄鱼鲞","凉拌海蜇","咸鸭蛋",
           "素炒三丝","拌莴笋条","茶叶蛋","白煮蛋","荷包蛋",
           "海苔条花生米","松花皮蛋","斜桥榨菜","麻油白腐乳",
           "四美什锦酱菜"]
PiNum = len(Pickles)
#主食5-22
Stable = ["鸡汁汤包","蟹黄汤包","刀削面","打卤面","荷叶饭","炒河粉",
          "热干面","凉拌冷面","菠萝炒饭","羊肉泡馍","肉夹馍","金银饭",
          "金黄锅贴","刀鱼面","鱼汤面","锅盖面","玉米饭","扬州炒饭",
		  "清露玉井饭",	#夏日特供
          "腊味煲仔饭","豆焖饭","五谷饭","油泼面","虾仁生煎"]	
StNum = len(Stable)
#荤菜5-25x5+4=129
Meat = ["早红橘络鸡","水晶肴肉","清蒸鲥鱼","双皮刀鱼","羊方藏鱼",
        "香酥芦花雀","盐水鸭翅","烩鲢鱼头","菊花醉鱼","生炝条虾",
        "扒烧整猪头","白汁鮰鱼","伍佑醉螺","豆角炒肉","冰糖肘子",
        "拆烩推浪鱼","高沟捆蹄","糖醋里脊","油焖大虾","碧螺虾仁",
        "清蒸大闸蟹","东坡肘子","香菇肉丸","虾仁炒蛋","砂锅鱼头",
        "羊肉炖萝卜","莲菜肉丝","透味熏鱼","洋葱肉丝","豉汁排骨",
        "芹菜炒猪肝","茅草烤鱼","酸汤鱼皮","酱爆花蛤","竹笋酿肉",
        "柠檬酸菜鱼","宫保鸡丁","红烧猪蹄","蘑菇炒肉","干爆鳝背",
        "陈酒醉膏蟹","常熟煨鸡","凤尾对虾","青椒肉丝","辣子肉丁",
        "海蜇头肉蟹","奶汤鱼皮","红烧排骨","炒回锅肉","猪肝鲜炒",
        "酸菜炖排骨","清蒸鲳鱼","洋葱肉丝","莴笋炒肉","辣椒肉丝",
        "红烧狮子头","粉条肉末","清蒸带鱼","芹菜肉丝","辣子鸡丁",
        "清炖羊蝎子","糖醋小黄鱼","梅菜扣肉","剁椒鱼头","炸里脊",
        "火腿烧土豆","酱烧黄花鱼","虾子鲞鱼","响油鳝丝","香辣虾",
        "凉拌火腿片","柠檬酸菜鱼","炭火烤肉","京酱肉丝","烧羊排",
        "河豚烧秧草","软排烧千张","凉拌猪耳","香菇山鸡","白斩鸡",
        "蒜蓉粉丝虾","老虎杠子鸡","松鼠桂鱼","响油鳝丝","手撕鸡",
        "咸鱼茄子煲","莴笋炒肉丝","红烧带鱼","红烧鲫鱼","过油肉",
        "土豆烧火腿丁","鱼香肉丝","蒜苔炒肉","水煮肉片","白切肉",
        "杏鲍菇炒肉丝","夫妻肺片","葱烧海参","蜜汁火方","黄焖鸡",
        "蒜茸丝瓜鲜虾盅","九转大肠","五香烤鸭","手把肉","盐焗鸡",
        "清炖蟹粉狮子头","雪花蟹斗","腐乳汁肉","叫花鸡","叉烤鸭",
        "清炖鸡孚松子肉","糖醋排骨","母油船鸭","八宝鸭","椰子鸡",
        "小豆腐泡烧肉丝","笋干扣肉","红烧肚档","肉蟹煲","老鸭煲",
        "蒜煲鳝筒","东坡肉","三杯鸡","毛血旺","锅包肉","猪脚姜",
        "瑶柱虾仁","瓦块鱼","糟扣肉","花雕鸡","香辣素毛肚",
		"草头圈子", #春夏特供
        "灯影牛肉","炸凤尾鱼","竹笋焖五花腩","清蒸鲈鱼"]
MeatNum = len(Meat)
#素4-76
Vegetable = ["凉拌穿心莲","韭黄炒鸡蛋","软炸鲜蘑","黄瓜炒蛋",
             "三菇烩豆腐","蒜蓉娃娃菜","醋溜白菜","酥炸耦合",
             "西红柿炒蛋","凉拌紫甘蓝","香菇青菜","油焖春笋",
             "手撕杏鲍菇","蟹黄汪豆腐","蒜蓉菜心","鱼香菜花",
             "油焖兰花笋","青菜豆腐羹","白灼生菜","爽脆藕片",
             "酸溜土豆丝","上汤娃娃菜","番茄菜花","炸糯米藕",
             "南乳空心菜","番茄土豆丝","苦瓜炒蛋","酸辣藕带",
             "白菜炖粉条","桂花蜜汁藕","白灼芥蓝","干煸花菜",
             "淮山炒木耳","红烧小土豆","荷塘小炒","麻婆豆腐",
             "三汁焖团子","清炒山药片","松仁玉米","茴香鸡蛋",
             "马兰头香干","芹菜炒香菇","文思豆腐","尖椒腐竹",
             "鸭血粉丝汤","花蛤鸡蛋羹","素炒芦蒿","素炒豆芽",
             "西红柿炒鸡蛋","清炒花菜","凉拌黄瓜","麻辣豆腐",
             "肉末汁烧油菜","包烧茄条","白灼莲菜","酥炸春卷",
             "西红柿烧茄子","蒜蓉豇豆","炒土豆丝","凉拌三丝",
             "脆爽凉拌木耳","茄子豆角","凉拌云丝","干煸豆角",
             "肉末烧汁豆腐","凉拌粉皮","三虾豆腐","青菜腐竹",
             "胡萝卜炒年糕","蒜炒豆角","素炒秋葵","凉拌木耳",
             "虾菇干烧芹菜","青椒豆腐","炒地三鲜","香辣白菜",
             "油焖兰花笋"]
VegNum = len(Vegetable)
#倌菜5xN-12
GVegetable = ["炒绿豆芽","炸茄盒","清炒莴笋","素拍黄瓜","清炖冬瓜",
              "素炒青菜","清炒腐竹","烧海带","烧茄子","凉拌莴笋",
              "素炒马齿苋","酸溜土豆丝","苦瓜炒蛋","炒干丝","酸溜白菜"]
GVnum = len(GVegetable)
#倌主食
GStable = ["软米饭","白面馒头","素面","冷面","菜包","玉米棒"]
#倌夜宵
GRefreshments = ["小黄瓜","西红柿","白煮蛋","酒酿小园子","蛋羹"]
#倌汤6xN-9
GSoup = ["菠菜汤","豆腐汤","绿豆汤","南瓜汤","白菜汤","生菜汤",
         "莲菜汤","鸡蛋汤","黄瓜汤","大米汤","鲜菇汤"]
GSnum = len(GSoup)

#汤4-24
Soup = ["玉米筒骨汤","鲫鱼豆腐汤","蛤蜊冬瓜汤","虾皮冬瓜汤",
        "萝卜老鸭汤","菠菜丸子汤","海带排骨汤","冬瓜莴笋汤",
        "番茄鸡蛋汤","黄豆猪蹄汤","鲜菇蔬菜汤","紫菜蛋花汤",
        "莼菜鲃肺汤","银鱼莼菜汤","莲藕排骨汤","萝卜排骨汤",
        "竹笋腊肉鲜味汤","竹笋番茄豆腐汤","鲫鱼汤","老鸭汤",
        "蟹味菇豆腐番茄汤","猪蹄黄豆汤","丝瓜蛋汤","奶白鱼汤",
        "川贝白果猪肺汤","栗米排骨汤","山药乳鸽汤"]
SoupNum = len(Soup)

#夜宵5
Supper = ["酸甜爽萝卜","香卤鸡腿","杏仁豆腐","蛋黄酥","蛋皮汤",
          "青瓜虾仁饺","木瓜雪蛤","酥炸蜂蛹","榛子酥","凌粉糍",
          "银耳雪梨羹","香炸蚕蛹","荠菜馄饨","红果酪","炒年糕",
          "木瓜炖雪蛤","酱汁凤爪","双蛋煎饼","豆腐酿","玉米烙",
          "桂花芡实羹","对虾姜酒","蝴蝶蒸饺","炸虾球","牛奶冻",
          "酥炸小黄鱼","藕粉圆子","香炸银鱼","酥肉饼","木莲芯",
          "糖炒山楂球","柴火馄饨","猪油松子","冬瓜盅","甜豆奶",
          "八宝莲子羹","凫卵双黄","涟水鸡糕","四喜饺","豌豆黄",
          "蛤蜊蒸蛋羹","小吊梨汤","糖炒栗子","银耳羹","酸梅汤",
          "桃胶炖银耳","炒瓜子仁","酥炸豌豆","烤冷面","茶叶蛋",
          "脱皮核桃仁","蟹粉小笼","荠菜汤包","鸡蛋卷","玉米烙",
          "三鲜小馄饨","杂粮煎饼","盐水毛豆","煮豆丹","拉凉皮",
          "甜/咸/辣豆腐花","油炸面包虫","奶香红薯","热牛乳",
          "海参炖盅","甜/咸粽子","麻辣鸭胗","川辣牛肉条","炸辣椒",
		  "酒香草头", #春夏特供
          "湘味豆干","凉拌核桃仁","肉饼炖咸蛋"]
SupperNum = len(Supper)
#茶点5-79
Refreshments = ["红糖马拉糕","白糖发糕","黄金糕","小米糕","白皮酥",
                "南瓜小麻球","玫瑰方糕","芙蓉羹","核桃酥","酒酿饼",
                "桂花藕糖糕","小元松糕","网油卷","荷叶糕","玉兰饼",
                "桂花糖芋苗","荤酒酿饼","梅花糕","玉带糕","蜜三刀",
                "水晶山楂糕","嵌桃麻糕","红豆糕","松子糖","杏仁酥",
                "羊奶千层糕","米饼小果","藕糖糕","荤雪饼","薄脆饼",
                "山药红豆糕","菊花酥饼","红薯糕","绿豆糕","小天酥",
                "水晶桂花糕","胡萝卜糕","松子卷","玫瑰饼","冰雪酥",
                "鲶鱼黄豆饼","白糖雪饼","核桃酥","佛手酥","合桃酥",
                "鲜虾豆腐饼","葱油桃酥","红豆包","牛舌饼","耳朵饼",
                "猪油松子酥","玉带酥","盘香酥","牛皮糖","豆沙饼",
                "赤小豆百合糕","山楂糕","玫瑰饼","芝麻酥","巧果",
                "松子枣泥麻饼","牛乳糕","枣花酥","如意酥","枣糕",
                "薏仁扁豆百合糕","杏麻饼","哈喱酥","酒酿饼","蒸糕",
                "当归川芎山药糕","薄荷糕","洋钱饼","茯苓糕","春饼",
				"雪花酪", # 夏日特供
                "赤豆酒酿小圆子","马蹄糕","蛋黄酥","酥桃饼","蛋奶酥",
				"琉璃薄荷糕","椰丝饼"]
ReNum = len(Refreshments)
#水果7xN-16
Fruits = ["雪梨","杏儿","李子","柑橘","葡萄","柚子",
          "水蜜桃","樱桃","脆桃","甘蕉","杨梅","草莓","枇杷",
          "灯笼果","无花果","花红","莲雾","青提"]
FruNum = len(Fruits)